docs/comp-sci/abstract-machines/secd.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-10 Sat 20:46 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>SECD Machine</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../abstract-machines.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">SECD Machine</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org50de900">1. Introduction</a></li>
<li><a href="#org9454bfd">2. Basic Data Structures</a></li>
<li><a href="#orgfed5830">3. Machine Description</a>
<ul>
<li><a href="#orgec3c6a5">3.1. The four "registers"</a></li>
<li><a href="#org10fee09">3.2. Operations</a></li>
<li><a href="#orgea4d5f1">3.3. Operation Transition Rules</a>
<ul>
<li><a href="#org7afc4d0">3.3.1. S-Expression related Rules</a></li>
<li><a href="#org1e487b5">3.3.2. Arithmetic Rules</a></li>
<li><a href="#orgc64b532">3.3.3. Loading Rules</a></li>
<li><a href="#org3dbb1c9">3.3.4. Conditional Form Rules</a></li>
<li><a href="#orgc66e0c7">3.3.5. Function Application</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcde4791">4. References</a>
<ul>
<li><a href="#orgaf77938">4.1. SECD Machine</a></li>
<li><a href="#orgaca9b38">4.2. Lisp to SECD Compiler</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org50de900" class="outline-2">
<h2 id="org50de900"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Landin introduced the SECD machine back in 1964, Plotkin used it in
the mid 1970s, and Henderson employed it in his book on Lispkit
in 1980.
</p>

<p>
We will discuss the description of the theoretical architecture of
the SECD machine (namely, its registers, its instruction
set, and how each operation transforms the SECD machine
state). Once we have finished this, we will consider a compiler
from Lisp to SECD instructions.
</p>

<p>
Why Lisp? Well, we don't need to consider a parser or grammar for a
simple input language. It's nothing more than wishing to avoid
difficulties.
</p>
</div>
</div>

<div id="outline-container-org9454bfd" class="outline-2">
<h2 id="org9454bfd"><span class="section-number-2">2</span> Basic Data Structures</h2>
<div class="outline-text-2" id="text-2">
<p>
The five key data structures SECD machines will build, manipulate, and
keep in memory:
</p>
<ol class="org-ol">
<li>Arbitrary S-expressions for computed data</li>
<li>Lists representing programs to be executed</li>
<li>Stacks used by the program's instructions</li>
<li>"Value lists" containing the arguments for uncompleted function applications</li>
<li>Closures to represent unprocessed function applications</li>
</ol>
</div>
</div>

<div id="outline-container-orgfed5830" class="outline-2">
<h2 id="orgfed5830"><span class="section-number-2">3</span> Machine Description</h2>
<div class="outline-text-2" id="text-3">
<p>
Like any abstract machine, we have some instruction set which
manipulates stacks or registers.
</p>
</div>

<div id="outline-container-orgec3c6a5" class="outline-3">
<h3 id="orgec3c6a5"><span class="section-number-3">3.1</span> The four "registers"</h3>
<div class="outline-text-3" id="text-3-1">
<p>
There are four "registers" (stacks):
</p>
<dl class="org-dl">
<dt><code>s</code> stack</dt><dd>holds intermediate results, it's a list of expressions</dd>
<dt><code>e</code> environment</dt><dd>holds values bound to variables</dd>
<dt><code>c</code> control</dt><dd>contains the code being executed</dd>
<dt><code>d</code> dump</dt><dd>stores the contents of the other registers
temporarily when a function-call occurs (and restores them upon
return)</dd>
</dl>

<p>
Everything in the environment <code>e</code> is given a unique ID, which is
essentially a tuple <code>(x, y)</code> where <code>x</code> is the location of the list
on the stack, <code>y</code> is the position in that list.
</p>
</div>
</div>

<div id="outline-container-org10fee09" class="outline-3">
<h3 id="org10fee09"><span class="section-number-3">3.2</span> Operations</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Following Henderson, we have the following instruction set for our
SECD machine:
</p>

<dl class="org-dl">
<dt><code>LD</code></dt><dd>load</dd>
<dt><code>LDC</code></dt><dd>load a constant onto the stack</dd>
<dt><code>LDF</code></dt><dd>load a function onto the stack</dd>
<dt><code>AP</code></dt><dd>apply a function</dd>
<dt><code>RTN</code></dt><dd>return</dd>
<dt><code>DUM</code></dt><dd>create a dummy environment</dd>
<dt><code>RAP</code></dt><dd>recursively apply</dd>
<dt><code>SEL</code></dt><dd>select subcontrol</dd>
<dt><code>JOIN</code></dt><dd>rejoin main control</dd>
<dt><code>CAR</code></dt><dd>take the <code>car</code> of the top of the <code>s</code> stack</dd>
<dt><code>CDR</code></dt><dd>take the <code>cdr</code> of the top of the <code>s</code> stack</dd>
<dt><code>ATOM</code></dt><dd>apply the <code>atom</code> predicate to the top stack item</dd>
<dt><code>CONS</code></dt><dd>form <code>cons</code> of top two stack items</dd>
<dt><code>EQ</code></dt><dd>apply <code>eq</code> predicate to top two stack items</dd>
<dt><code>STOP</code></dt><dd>stop the machine, we're done</dd>
</dl>

<p>
And then about a half-dozen arithmetic operators (<code>ADD</code>, <code>SUB</code>,
<code>MUL</code>, <code>DIV</code>, <code>REM</code>, <code>LEQ</code>).
</p>
</div>
</div>

<div id="outline-container-orgea4d5f1" class="outline-3">
<h3 id="orgea4d5f1"><span class="section-number-3">3.3</span> Operation Transition Rules</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The semantics for our SECD machine is described using a transition
relation which maps <code>s e c d -&gt; s' e' c' d'</code>.
</p>
</div>

<div id="outline-container-org7afc4d0" class="outline-4">
<h4 id="org7afc4d0"><span class="section-number-4">3.3.1</span> S-Expression related Rules</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
The <code>CONS</code>, <code>CDR</code>, <code>CAR</code> instructions behave as we would hope and
expect:
</p>

<dl class="org-dl">
<dt><code>CONS</code></dt><dd><code>(a b . s) e (CONS . c) d</code> becomes <code>((a . b) . s) e c d</code></dd>
<dt><code>CAR</code></dt><dd><code>((a . b) . s) e (CAR . c) d</code> becomes <code>(a . s) e c d</code></dd>
<dt><code>CDR</code></dt><dd><code>((a . b) . s) e (CDR . c) d</code> becomes <code>(b . s) e c d</code></dd>
</dl>

<p>
The <code>ATOM</code> predicate tests if the top item in <code>s</code> is an atomic
datum or not.
</p>

<dl class="org-dl">
<dt><code>ATOM</code></dt><dd><code>(a . s) e (ATOM . c) d</code> becomes <code>(t . s) e c d</code> where
<code>t=T</code> if <code>a</code> is in fact an atom, <code>t=F</code> if <code>a</code> is a list.</dd>
</dl>
</div>
</div>

<div id="outline-container-org1e487b5" class="outline-4">
<h4 id="org1e487b5"><span class="section-number-4">3.3.2</span> Arithmetic Rules</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
The arithmetic operations applied to the top 2 items of the stack,
but do not modify the other registers:
</p>

<ul class="org-ul">
<li><code>ADD</code> takes <code>(a b . s)</code> and produces <code>(b + a . s)</code></li>
<li><code>SUB</code> takes <code>(a b . s)</code> and produces <code>(b - a . s)</code></li>
<li><code>MUL</code> takes <code>(a b . s)</code> and produces <code>(b * a . s)</code></li>
<li><code>DIV</code> takes <code>(a b . s)</code> and produces <code>(b / a . s)</code></li>
<li><code>REM</code> takes <code>(a b . s)</code> and produces <code>(b % a . s)</code></li>
<li><code>LEQ</code> takes <code>(a b . s)</code> and produces <code>(b &lt;= a . s)</code></li>
<li><code>EQ</code>  takes <code>(a b . s)</code> and produces <code>(b = a . s)</code></li>
</ul>
</div>
</div>


<div id="outline-container-orgc64b532" class="outline-4">
<h4 id="orgc64b532"><span class="section-number-4">3.3.3</span> Loading Rules</h4>
<div class="outline-text-4" id="text-3-3-3">
<dl class="org-dl">
<dt><code>LD</code></dt><dd><code>s e (LD i . c) d</code> becomes <code>(x . s) e c d</code> where
<code>x = locate(i, e)</code> is the current value for the index <code>i</code>, and
<code>locate()</code> is a function in the meta-language</dd>
<dt><code>LDC</code></dt><dd><code>s e (LDC n . c) d</code> becomes <code>(n . s) e c d</code></dd>
<dt><code>LDF</code></dt><dd><code>s e (LDF c' . c) d</code> becomes <code>((c' . e) . s) e c d</code>
where the closure is <code>(c' . e)</code>.</dd>
</dl>

<p>
The pseudocode for the <code>locate()</code> function requires first
introducing a function which returns the <code>nth</code> member of a list
(zero-indexed):
</p>

<pre class="example" id="org4a9ba6a">
index :: Int -&gt; List -&gt; a
index 0 s = car(s)
index n s = if n &lt; 0 then error "Must have non-negative index number"
            else index (n - 1) cdr(s)
</pre>

<p>
We use this to define a function which determines, for an index
pair <code>i = (b . n)</code> the corresponding value in the environment:
</p>

<pre class="example" id="org1e4278c">
locate :: (Int, Int) -&gt; Env -&gt; a
locate (b, n) e = index n (index b e)
</pre>
</div>
</div>

<div id="outline-container-org3dbb1c9" class="outline-4">
<h4 id="org3dbb1c9"><span class="section-number-4">3.3.4</span> Conditional Form Rules</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
There are two instructions for conditional forms, namely <code>SEL</code>
selects a sublist of the control based on the value at the top of
the stack, and <code>JOIN</code> rejoins the main control. We could then
expect the control to look like
</p>

<p>
<code>(... SEL c_TRUE c_FALSE c)</code>
</p>

<p>
where both <code>c_TRUE</code> and <code>c_FALSE</code> look like a list whose last
element is <code>JOIN</code>, i.e., <code>c_T = (... JOIN)</code>.
</p>

<dl class="org-dl">
<dt><code>SEL</code></dt><dd><code>(x . s) e (SEL c_T c_F . c) d</code> becomes <code>s e c_X (c . d)</code>
where <code>c_X</code> is <code>c_T</code> if <code>x = T</code>, and <code>c_X</code> is <code>c_F</code> if <code>x = F</code></dd>
<dt><code>JOIN</code></dt><dd><code>s e (JOIN) (c . d)</code> evaluates to <code>s e c d</code></dd>
</dl>

<p>
So <code>SEL</code> is a jump instruction, <code>JOIN</code> jumps back to the function
caller.
</p>
</div>
</div>

<div id="outline-container-orgc66e0c7" class="outline-4">
<h4 id="orgc66e0c7"><span class="section-number-4">3.3.5</span> Function Application</h4>
<div class="outline-text-4" id="text-3-3-5">
<p>
We need to bear in mind how we encode closures, because they govern
how we implement <code>AP</code>, <code>RTN</code>, etc. A closure is just <code>(c . e)</code> a
pair of instructions plus an environment for it.
</p>

<dl class="org-dl">
<dt><code>AP</code></dt><dd><code>((c' . e') v . s) e (AP .c) d</code> evaluates to
<code>NIL (v . e') c' (s e c . d)</code> a state with:
<ol class="org-ol">
<li>a fresh <code>NIL</code> stack,</li>
<li>a new environment <code>(v . e')</code>,</li>
<li>the instructions to execute <code>c'</code> given by the function body, and</li>
<li>the saved state at the time of function call <code>(s e c . d)</code></li>
</ol></dd>
<dt><code>RTN</code></dt><dd><code>(x) e' (RTN) (s e c . d)</code> becomes
<code>(x . s) e c d</code>, it restores the previous state of the <code>e</code>, <code>c</code>,
<code>d</code> registers, and pushes <code>x</code> to the top of the previous <code>s</code> register-state.</dd>
<dt><code>DUM</code></dt><dd>creating a new environment with <code>PENDING</code> as the first
sublist, transforms <code>s e (DUM . c) d</code> into <code>s (PENDING . e) c d</code>.</dd>
<dt><code>RAP</code></dt><dd>recursively apply, <code>((c' . e') v . s) (PENDING . e) (RAP . c) d</code>
becomes <code>NIL rplaca(e', v) c' (s e c . d)</code> where <code>rplaca</code> is a
function in the metalanguage (compare to <code>AP</code> which instead had
<code>(v . e')</code> directly)</dd>
</dl>

<p>
The recursive aspect of <code>RAP</code> is due to <code>rplaca</code> which amounts to
be a <code>(setf (car e') v)</code> (thus replacing the <code>PENDING</code> dummy
metasymbol introduced by <code>DUM</code>). The mnemonic really is <code>rplaca(x,y)</code>
"replace car of <code>x</code> by <code>y</code> and return pointer to <code>x</code>".
</p>

<p>
Remember when we noted <code>e</code> is basically a stack of lists, and data
stored in the <code>e</code> environment is given a unique identifier <code>(x, y)</code> ?
In a typical function call with <code>AP</code>, a new list is pushed onto
<code>e</code>. Any local variables now look like <code>(len(e), y)</code>. This <code>len(e)</code>
is problematic for recursive functions, because the stack grows
with each recursive function call.
</p>

<p>
That's why <code>RAP</code>, instead of pushing a new list onto the
environment stack, simply replaces whatever is at the head of <code>e</code>
with a new environment list.
</p>

<div class="remark" id="org5dbecce">
<p>
For further consideration about recursive functions in SECD,
consider also reading John Ramsdell's "The Tail-Recursive SECD Machine"
(1999).
</p>

</div>
</div>
</div>
</div>
</div>


<div id="outline-container-orgcde4791" class="outline-2">
<h2 id="orgcde4791"><span class="section-number-2">4</span> References</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Peter Henderson,
<i>Functional Programming: Application and Implementation</i>.
Prentice-Hall International Series in Computer Science,
<ol class="org-ol">
<li>See especially chapter 6.</li>
</ol></li>
<li>Gordon Plotkin,
"Call-byname, call-by-value and the lambda-calculus".
<i>Theoretical Computer Science</i> <b>1</b> (1975) pp. 125-159.</li>
</ul>
</div>

<div id="outline-container-orgaf77938" class="outline-3">
<h3 id="orgaf77938"><span class="section-number-3">4.1</span> SECD Machine</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><a href="https://stackoverflow.com/q/7547951">StackOverflow thread</a></li>
<li>Jia-Huai You, <a href="https://webdocs.cs.ualberta.ca/~you/courses/325/Mynotes/Fun/SECD-slides.html">SECD Virtual Machine</a> (<a href="https://web.archive.org/web/20150527050004/http://webdocs.cs.ualberta.ca/~you/courses/325/Mynotes/Fun/SECD-slides.html">archive</a>, lecture notes/slides)</li>
<li>John D. Ramsdell, "The Tail-Recursive SECD Machine". Manuscript
dated 1999.</li>
<li><a href="https://netzhansa.blogspot.com/2008/09/revisiting-secd-and-power-of-lisp-while.html">Revisiting SECD and the Power of Lisp</a></li>
<li>P.M. Kogge,
<cite class="book-title">The Architecture of Symbolic Computers</cite>.
McGraw&#x2013;Hill, 1991, ch. 7.</li>
<li>W.H. Burge,
<cite class="book-title">Recursive Programming Techniques</cite>.
Addison-Wesley, 1975.</li>
</ul>
</div>
</div>

<div id="outline-container-orgaca9b38" class="outline-3">
<h3 id="orgaca9b38"><span class="section-number-3">4.2</span> Lisp to SECD Compiler</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Peter Henderson's book is about this very topic</li>
<li>Milos Radovanovic, Mirjana Ivanovic, "An Implementation of
Lispkit Lisp in Java". In <i>Proc. XV Conf. on Applied Math.</i>,
2002, pp.169-178</li>
<li><a href="https://www.brics.dk/RS/03/33/BRICS-RS-03-33.pdf">A Rational Deconstruction of Landin’s SECD Machine</a></li>
<li><a href="https://stackoverflow.com/q/7547951">In the SECD Machine how does “rap” work?</a></li>
<li><a href="https://prism.ucalgary.ca/handle/1880/46590">SECD: Design Issues</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-03-18 Thu 16:18.</p>
</div>
</body>
</html>